vigneswaranj/UnityKeilSTM32/CMSIS/Headers/STM32Defs.h
/* ===============================================================
   == CMSIS Library                                             ==
   == Copyright Rotork Controls Ltd                             ==
   ===============================================================
   == $Workfile::   STM32Defs.h                               $ ==
   == $Revision::   1.6                                       $ ==
   ==  $Modtime::   22 Jun 2009 15:53:10                      $ ==
   ==   $Author::   Alan Budden                               $ ==
   ==                                                           ==
   == Compiler:     Keil uVision                                ==
   == Target:       STM32                                       ==
   == Description:  STM32 Extra Definitions                     ==
   ==                                                           ==
   =============================================================== */

#ifndef _STM32DEFS_H
#define _STM32DEFS_H

/* == include files ============================================== */
#include "stm32f10x.h"

/* == #defines =================================================== */
/* The Keil library headers don't include a lot of bit definitions,
   so we add our own */

/**
 * @{
 * Pin Macros.
 *
 * These are a hardware abstraction layer and are not intended to be used
 * directly: they are remapped to other macros with more meaningful names.
 *
 * Call as (e.g.):
 * 
 *     PIN_SetHigh(GPIOA, 0)
 *
 * or:
 *     
 *     #define PORT_LED_BLUE GPIOB
 *     #define PIN_LED_BLUE  ((u8) 5)
 *     #define LED_BlueOn    PIN_SetLow(PORT_LED_BLUE, PIN_LED_BLUE)
 *     #define LED_BlueOff   PIN_SetHigh(PORT_LED_BLUE, PIN_LED_BLUE)
 */

/** Check whether an input GPIO pin is currently high. */
#define PIN_IsHigh(port, u8Number) GLOBAL_bIsTrue(((port)->IDR  & (((u32) 1) << (u8Number))) == (((u32) 1) << (u8Number)))
/** Check whether an input GPIO pin is currently high (alternative name for naming convention) */
#define PIN_bIsHigh(port, u8Number) PIN_IsHigh(port, u8Number)
/** Check whether an input GPIO pin is currently low. */
#define PIN_IsLow(port, u8Number)  GLOBAL_bIsFalse(((port)->IDR & (((u32) 1) << (u8Number))) == (((u32) 1) << (u8Number)))
/** Check whether an input GPIO pin is currently low (alternative name for naming convention) */
#define PIN_bIsLow(port, u8Number) PIN_IsLow(port, u8Number)
/** Drive an output GPIO pin high or set it to pull-up mode (depending on whether it's an output or input). */
#define PIN_SetHigh(port, u8Number)   MACROOP((port)->BSRR = (u32) (((u32) 1) << (u8Number));)
/** Drive an output GPIO pin low or set it to pull-down mode (depending on whether it's an output or input). */
#define PIN_SetLow(port, u8Number)    MACROOP((port)->BRR  = (u32) (((u32) 1) << (u8Number));)
/** Toggle the state of an output GPIO pin. */
#define PIN_Toggle(port, u8Number) \
	MACROOP((port)->BSRR = \
			PIN_IsHigh(port, u8Number) \
			? ((u32) (((u32) 1) << (u8Number+16))) \
			: ((u32) (((u32) 1) << (u8Number)));)
/** Set a pin in a required mode. */
/* TODO: Consider making this into a function.
 * Need to decide where to put the source for the function and how to handle Lint if
 * it isn't then used.
 */
#define PIN_SetMode(port, u8Number, mode)                           \
	MACROOP(                                                        \
			/*lint -save -e774 -e506 -e778 */                       \
			/* These errors are related to the fact that */         \
			/* different code will be produced depending on */      \
			/* whether u8Number is 0-7 or 8-15 */                   \
			u8 u8Shift = (u8) (((u8) (((u8) u8Number) & 0x07u)) << 2u);    \
			u32 u32Mask = (u32) (((u32) 0x0Fu) << u8Shift);         \
			if (u8Number < 8)                                       \
			{                                                       \
				(port)->CRL &= (u32) ~u32Mask;                      \
				(port)->CRL |= ((u32) (((u32) mode) ) << u8Shift);  \
			}                                                       \
			else                                                    \
			{                                                       \
				(port)->CRH &= (u32) ~u32Mask;                      \
				(port)->CRH |= ((u32) (((u32) mode) ) << u8Shift);  \
			}                                                       \
			/*lint -restore */                                      \
			)

/** Pin is analogue input */
#define PIN_InputAnalogue (GPIO_CR_MODE_In | GPIO_CR_CNF_InAnalog)
/** Pin is input with pull up or pull down */
#define PIN_InputPull (GPIO_CR_MODE_In | GPIO_CR_CNF_InPull)
/** Pin is floating input */
#define PIN_InputFloat (GPIO_CR_MODE_In | GPIO_CR_CNF_InFloat)
/** Pin is a 2MHz max output in push-pull GPIO mode */
#define PIN_OutputGPIO_PP2MHz (GPIO_CR_MODE_Out2MHz | GPIO_CR_CNF_OutGP_PP)
/** Pin is a 2MHz max output in open-drain GPIO mode */
#define PIN_OutputGPIO_OD2MHz (GPIO_CR_MODE_Out2MHz | GPIO_CR_CNF_OutGP_OD)
/** Pin is a 2MHz max output in push-pull AFIO mode */
#define PIN_OutputAFIO_PP2MHz (GPIO_CR_MODE_Out2MHz | GPIO_CR_CNF_OutAF_PP)
/** Pin is a 2MHz max output in open-drain AFIO mode */
#define PIN_OutputAFIO_OD2MHz (GPIO_CR_MODE_Out2MHz | GPIO_CR_CNF_OutAF_OD)
/** Pin is a 10MHz max output in push-pull GPIO mode */
#define PIN_OutputGPIO_PP10MHz (GPIO_CR_MODE_Out10MHz | GPIO_CR_CNF_OutGP_PP)
/** Pin is a 10MHz max output in open-drain GPIO mode */
#define PIN_OutputGPIO_OD10MHz (GPIO_CR_MODE_Out10MHz | GPIO_CR_CNF_OutGP_OD)
/** Pin is a 10MHz max output in push-pull AFIO mode */
#define PIN_OutputAFIO_PP10MHz (GPIO_CR_MODE_Out10MHz | GPIO_CR_CNF_OutAF_PP)
/** Pin is a 10MHz max output in open-drain AFIO mode */
#define PIN_OutputAFIO_OD10MHz (GPIO_CR_MODE_Out10MHz | GPIO_CR_CNF_OutAF_OD)
/** Pin is a 50MHz max output in push-pull GPIO mode */
#define PIN_OutputGPIO_PP50MHz (GPIO_CR_MODE_Out50MHz | GPIO_CR_CNF_OutGP_PP)
/** Pin is a 50MHz max output in open-drain GPIO mode */
#define PIN_OutputGPIO_OD50MHz (GPIO_CR_MODE_Out50MHz | GPIO_CR_CNF_OutGP_OD)
/** Pin is a 50MHz max output in push-pull AFIO mode */
#define PIN_OutputAFIO_PP50MHz (GPIO_CR_MODE_Out50MHz | GPIO_CR_CNF_OutAF_PP)
/** Pin is a 50MHz max output in open-drain AFIO mode */
#define PIN_OutputAFIO_OD50MHz (GPIO_CR_MODE_Out50MHz | GPIO_CR_CNF_OutAF_OD)

/** Set a pin as an analogue input */
#define PIN_SetInputAnalogue(port, u8Number) PIN_SetMode(port, u8Number, PIN_InputAnalogue)
/** Set a pin as a pulled input */
#define PIN_SetInputPull(port, u8Number) PIN_SetMode(port, u8Number, PIN_InputPull)
/** Set a pin as a floating input */
#define PIN_SetInputFloat(port, u8Number) PIN_SetMode(port, u8Number, PIN_InputFloat)
/** Set a pin as a 2MHz max output in push-pull GPIO mode */
#define PIN_SetOutputGPIO_PP2MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputGPIO_PP2MHz)
/** Set a pin as a 2MHz max output in open-drain GPIO mode */
#define PIN_SetOutputGPIO_OD2MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputGPIO_OD2MHz)
/** Set a pin as a 2MHz max output in push-pull AFIO mode */
#define PIN_SetOutputAFIO_PP2MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputAFIO_PP2MHz)
/** Set a pin as a 2MHz max output in open-drain AFIO mode */
#define PIN_SetOutputAFIO_OD2MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputAFIO_OD2MHz)
/** Set a pin as a 10MHz max output in push-pull GPIO mode */
#define PIN_SetOutputGPIO_PP10MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputGPIO_PP10MHz)
/** Set a pin as a 10MHz max output in open-drain GPIO mode */
#define PIN_SetOutputGPIO_OD10MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputGPIO_OD10MHz)
/** Set a pin as a 10MHz max output in push-pull AFIO mode */
#define PIN_SetOutputAFIO_PP10MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputAFIO_PP10MHz)
/** Set a pin as a 10MHz max output in open-drain AFIO mode */
#define PIN_SetOutputAFIO_OD10MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputAFIO_OD10MHz)
/** Set a pin as a 50MHz max output in push-pull GPIO mode */
#define PIN_SetOutputGPIO_PP50MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputGPIO_PP50MHz)
/** Set a pin as a 50MHz max output in open-drain GPIO mode */
#define PIN_SetOutputGPIO_OD50MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputGPIO_OD50MHz)
/** Set a pin as a 50MHz max output in push-pull AFIO mode */
#define PIN_SetOutputAFIO_PP50MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputAFIO_PP50MHz)
/** Set a pin as a 50MHz max output in open-drain AFIO mode */
#define PIN_SetOutputAFIO_OD50MHz(port, u8Number) PIN_SetMode(port, u8Number, PIN_OutputAFIO_OD50MHz)

/** @} */

