vigneswaranj/UnityKeilSTM32/CMSIS/Headers/STM32Defs.h
/** Reset the CPU. */
#define CPU_Reset() MACROOP(SCB->AIRCR = (SCB->AIRCR & ((u32) 0x0000FFFFu)) | ((u32) 0x05FA0004u);)

/* --------------------------------------------------------------- */
/* Power control (PWR) */

/* PWR_CR: Power control register */

#define PWR_CR_PLS_2_2V    (u32) 0x00000000
#define PWR_CR_PLS_2_3V    (PWR_CR_PLS_0)
#define PWR_CR_PLS_2_4V    (PWR_CR_PLS_1)
#define PWR_CR_PLS_2_5V    (PWR_CR_PLS_0 | PWR_CR_PLS_1)
#define PWR_CR_PLS_2_6V    (PWR_CR_PLS_2)
#define PWR_CR_PLS_2_7V    (PWR_CR_PLS_2 | PWR_CR_PLS_0)
#define PWR_CR_PLS_2_8V    (PWR_CR_PLS_2 | PWR_CR_PLS_1)
#define PWR_CR_PLS_2_9V    (PWR_CR_PLS_2 | PWR_CR_PLS_1 | PWR_CR_PLS_0)

/* --------------------------------------------------------------- */
/* USART Configuration */
#define USART_CR2_STOP_1_BIT  ((u16) 0)
#define USART_CR2_STOP_0_5_BIT  USART_CR2_STOP_0
#define USART_CR2_STOP_2_BITS USART_CR2_STOP_1
#define USART_CR2_STOP_1_5_BITS (USART_CR2_STOP_1 | USART_CR2_STOP_0)

/* --------------------------------------------------------------- */
/* Reset & clock control (RCC) */

/* Clock control register (RCC_CR) */

#define RCC_CR_HSITRIM_MASK  (u32) 0x000000F8
#define RCC_CR_HSITRIM_SHIFT (u8) 3

#define RCC_CR_Default       ((u32) 0x00000083)
#define RCC_CFGR_Default     ((u32) 0x00000000)


/* Windowed Watchdog registers */
#define WWDG_CFR_WDGTB_1   (u32) 0x00000000
#define WWDG_CFR_WDGTB_2   (u32) 0x00000080
#define WWDG_CFR_WDGTB_4   (u32) 0x00000100
#define WWDG_CFR_WDGTB_8   (u32) 0x00000180


/* --------------------------------------------------------------- */
/* GPIO */

/* Pins */
#define GPIO_Pin_0                 ((u16)0x0001)  /* Pin 0 selected */
#define GPIO_Pin_1                 ((u16)0x0002)  /* Pin 1 selected */
#define GPIO_Pin_2                 ((u16)0x0004)  /* Pin 2 selected */
#define GPIO_Pin_3                 ((u16)0x0008)  /* Pin 3 selected */
#define GPIO_Pin_4                 ((u16)0x0010)  /* Pin 4 selected */
#define GPIO_Pin_5                 ((u16)0x0020)  /* Pin 5 selected */
#define GPIO_Pin_6                 ((u16)0x0040)  /* Pin 6 selected */
#define GPIO_Pin_7                 ((u16)0x0080)  /* Pin 7 selected */
#define GPIO_Pin_8                 ((u16)0x0100)  /* Pin 8 selected */
#define GPIO_Pin_9                 ((u16)0x0200)  /* Pin 9 selected */
#define GPIO_Pin_10                ((u16)0x0400)  /* Pin 10 selected */
#define GPIO_Pin_11                ((u16)0x0800)  /* Pin 11 selected */
#define GPIO_Pin_12                ((u16)0x1000)  /* Pin 12 selected */
#define GPIO_Pin_13                ((u16)0x2000)  /* Pin 13 selected */
#define GPIO_Pin_14                ((u16)0x4000)  /* Pin 14 selected */
#define GPIO_Pin_15                ((u16)0x8000)  /* Pin 15 selected */
#define GPIO_Pin_All               ((u16)0xFFFF)  /* All pins selected */

#define GPIO_Pin_N(u8Number)       ((u16) (1u << u8Number))

/* GPIOx_CRy: Port configuration registers */
/* Mode */
#define GPIO_CR_MODE_In          (u32) 0x0
#define GPIO_CR_MODE_Out10MHz    (u32) 0x1
#define GPIO_CR_MODE_Out2MHz     (u32) 0x2
#define GPIO_CR_MODE_Out50MHz    (u32) 0x3
/* Inputs */
#define GPIO_CR_CNF_InAnalog     (u32) 0x0
#define GPIO_CR_CNF_InFloat      (u32) 0x4
#define GPIO_CR_CNF_InPull       (u32) 0x8
#define GPIO_CR_CNF_InReserved   (u32) 0xC
/* Outputs */
#define GPIO_CR_CNF_OutGP_PP     (u32) 0x0 /* General purpose; push-pull */
#define GPIO_CR_CNF_OutGP_OD     (u32) 0x4 /* General purpose; open drain */
#define GPIO_CR_CNF_OutAF_PP     (u32) 0x8 /* Alternate function; push-pull*/
#define GPIO_CR_CNF_OutAF_OD     (u32) 0xC /* Alternate function; open drain */

/* GPIOx_CRH: Port configuration register high */
#define GPIO_CRH15(u4Config)   (u32) ((u4Config) << 28)
#define GPIO_CRH14(u4Config)   (u32) ((u4Config) << 24)
#define GPIO_CRH13(u4Config)   (u32) ((u4Config) << 20)
#define GPIO_CRH12(u4Config)   (u32) ((u4Config) << 16)
#define GPIO_CRH11(u4Config)   (u32) ((u4Config) << 12)
#define GPIO_CRH10(u4Config)   (u32) ((u4Config) <<  8)
#define GPIO_CRH09(u4Config)   (u32) ((u4Config) <<  4)
#define GPIO_CRH08(u4Config)   (u32) ((u4Config) <<  0)

/* GPIOx_CRL: Port configuration register low */
#define GPIO_CRL07(u4Config)   (u32) ((u4Config) << 28)
#define GPIO_CRL06(u4Config)   (u32) ((u4Config) << 24)
#define GPIO_CRL05(u4Config)   (u32) ((u4Config) << 20)
#define GPIO_CRL04(u4Config)   (u32) ((u4Config) << 16)
#define GPIO_CRL03(u4Config)   (u32) ((u4Config) << 12)
#define GPIO_CRL02(u4Config)   (u32) ((u4Config) <<  8)
#define GPIO_CRL01(u4Config)   (u32) ((u4Config) <<  4)
#define GPIO_CRL00(u4Config)   (u32) ((u4Config) <<  0)

/* --------------------------------------------------------------- */
/* NVIC */

#ifdef STM32F10X_CL

/** Interrupt Enable for Window Watchdog interrupt global interrupt. */
#define NVIC_ISER0_WWDG          ((u32) 0x00000001)
/** Interrupt Enable for PVD through EXTI Line detection interrupt global interrupt. */
#define NVIC_ISER0_PVD           ((u32) 0x00000002)
/** Interrupt Enable for Tamper interrupt global interrupt. */
#define NVIC_ISER0_TAMPER        ((u32) 0x00000004)
/** Interrupt Enable for RTC global interrupt global interrupt. */
#define NVIC_ISER0_RTC           ((u32) 0x00000008)
/** Interrupt Enable for Flash global interrupt global interrupt. */
#define NVIC_ISER0_FLASH         ((u32) 0x00000010)
/** Interrupt Enable for RCC global interrupt global interrupt. */
#define NVIC_ISER0_RCC           ((u32) 0x00000020)
/** Interrupt Enable for EXTI Line0 interrupt global interrupt. */
#define NVIC_ISER0_EXTI0         ((u32) 0x00000040)
/** Interrupt Enable for EXTI Line1 interrupt global interrupt. */
#define NVIC_ISER0_EXTI1         ((u32) 0x00000080)
/** Interrupt Enable for EXTI Line2 interrupt global interrupt. */
#define NVIC_ISER0_EXTI2         ((u32) 0x00000100)
/** Interrupt Enable for EXTI Line3 interrupt global interrupt. */
#define NVIC_ISER0_EXTI3         ((u32) 0x00000200)
/** Interrupt Enable for EXTI Line4 interrupt global interrupt. */
#define NVIC_ISER0_EXTI4         ((u32) 0x00000400)
/** Interrupt Enable for DMA1 Channel1 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel1 ((u32) 0x00000800)
/** Interrupt Enable for DMA1 Channel2 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel2 ((u32) 0x00001000)
/** Interrupt Enable for DMA1 Channel3 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel3 ((u32) 0x00002000)
/** Interrupt Enable for DMA1 Channel4 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel4 ((u32) 0x00004000)
/** Interrupt Enable for DMA1 Channel5 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel5 ((u32) 0x00008000)
/** Interrupt Enable for DMA1 Channel6 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel6 ((u32) 0x00010000)
/** Interrupt Enable for DMA1 Channel7 global interrupt global interrupt. */
#define NVIC_ISER0_DMA1_Channel7 ((u32) 0x00020000)
/** Interrupt Enable for ADC1 and ADC2 global interrupt global interrupt. */
#define NVIC_ISER0_ADC1_2        ((u32) 0x00040000)
/** Interrupt Enable for CAN1 TX interrupts global interrupt. */
#define NVIC_ISER0_CAN1_TX       ((u32) 0x00080000)
/** Interrupt Enable for CAN1 RX0 interrupts global interrupt. */
#define NVIC_ISER0_CAN1_RX0      ((u32) 0x00100000)
/** Interrupt Enable for CAN1 RX1 interrupt global interrupt. */
#define NVIC_ISER0_CAN1_RX1      ((u32) 0x00200000)
/** Interrupt Enable for CAN1 SCE interrupt global interrupt. */
#define NVIC_ISER0_CAN1_SCE      ((u32) 0x00400000)
/** Interrupt Enable for EXTI Line[9:5] interrupts global interrupt. */
#define NVIC_ISER0_EXTI9_5       ((u32) 0x00800000)
/** Interrupt Enable for TIM1 Break interrupt global interrupt. */
#define NVIC_ISER0_TIM1_BRK      ((u32) 0x01000000)
/** Interrupt Enable for TIM1 Update interrupt global interrupt. */
#define NVIC_ISER0_TIM1_UP       ((u32) 0x02000000)
/** Interrupt Enable for TIM1 Trigger and Commutation interrupts global interrupt. */
#define NVIC_ISER0_TIM1_TRG_COM  ((u32) 0x04000000)
/** Interrupt Enable for TIM1 Capture Compare interrupt global interrupt. */
#define NVIC_ISER0_TIM1_CC       ((u32) 0x08000000)
/** Interrupt Enable for TIM2 global interrupt global interrupt. */
#define NVIC_ISER0_TIM2          ((u32) 0x10000000)
/** Interrupt Enable for TIM3 global interrupt global interrupt. */
#define NVIC_ISER0_TIM3          ((u32) 0x20000000)
/** Interrupt Enable for TIM4 global interrupt global interrupt. */
#define NVIC_ISER0_TIM4          ((u32) 0x40000000)
/** Interrupt Enable for I2C1 event interrupt global interrupt. */
#define NVIC_ISER0_I2C1_EV       ((u32) 0x80000000)
/** Interrupt Enable for I2C1 error interrupt global interrupt. */
#define NVIC_ISER1_I2C1_ER       ((u32) 0x00000001)
/** Interrupt Enable for I2C2 event interrupt global interrupt. */
#define NVIC_ISER1_I2C2_EV       ((u32) 0x00000002)
/** Interrupt Enable for I2C2 error interrupt global interrupt. */
#define NVIC_ISER1_I2C2_ER       ((u32) 0x00000004)
/** Interrupt Enable for SPI1 global interrupt global interrupt. */
#define NVIC_ISER1_SPI1          ((u32) 0x00000008)
/** Interrupt Enable for SPI2 global interrupt global interrupt. */
#define NVIC_ISER1_SPI2          ((u32) 0x00000010)
/** Interrupt Enable for USART1 global interrupt global interrupt. */
#define NVIC_ISER1_USART1        ((u32) 0x00000020)
/** Interrupt Enable for USART2 global interrupt global interrupt. */
#define NVIC_ISER1_USART2        ((u32) 0x00000040)
/** Interrupt Enable for USART3 global interrupt global interrupt. */
#define NVIC_ISER1_USART3        ((u32) 0x00000080)
/** Interrupt Enable for EXTI Line[15:10] interrupts global interrupt. */
#define NVIC_ISER1_EXTI15_10     ((u32) 0x00000100)
/** Interrupt Enable for RTC alarm through EXTI line interrupt global interrupt. */
#define NVIC_ISER1_RTCAlarm      ((u32) 0x00000200)
/** Interrupt Enable for USB On-The-Go FS Wakeup through EXTI line interrupt global interrupt. */
#define NVIC_ISER1_OTG_FS_WKUP   ((u32) 0x00000400)
/* RESERVED SPACE IN HERE */
/** Interrupt Enable for TIM5 global interrupt global interrupt. */
#define NVIC_ISER1_TIM5          ((u32) 0x00040000)
/** Interrupt Enable for SPI3 global interrupt global interrupt. */
#define NVIC_ISER1_SPI3          ((u32) 0x00080000)
/** Interrupt Enable for UART4 global interrupt global interrupt. */
#define NVIC_ISER1_UART4         ((u32) 0x00100000)
/** Interrupt Enable for UART5 global interrupt global interrupt. */
#define NVIC_ISER1_UART5         ((u32) 0x00200000)
/** Interrupt Enable for TIM6 global interrupt global interrupt. */
#define NVIC_ISER1_TIM6          ((u32) 0x00400000)
/** Interrupt Enable for TIM7 global interrupt global interrupt. */
#define NVIC_ISER1_TIM7          ((u32) 0x00800000)
/** Interrupt Enable for DMA2 Channel1 global interrupt global interrupt. */
#define NVIC_ISER1_DMA2_Channel1 ((u32) 0x01000000)
/** Interrupt Enable for DMA2 Channel2 global interrupt global interrupt. */
#define NVIC_ISER1_DMA2_Channel2 ((u32) 0x02000000)
/** Interrupt Enable for DMA2 Channel3 global interrupt global interrupt. */
#define NVIC_ISER1_DMA2_Channel3 ((u32) 0x04000000)
/** Interrupt Enable for DMA2 Channel4 global interrupt global interrupt. */
#define NVIC_ISER1_DMA2_Channel4 ((u32) 0x08000000)
/** Interrupt Enable for DMA2 Channel5 global interrupt global interrupt. */
#define NVIC_ISER1_DMA2_Channel5 ((u32) 0x10000000)
/** Interrupt Enable for Ethernet global interrupt global interrupt. */
#define NVIC_ISER1_ETH           ((u32) 0x20000000)
/** Interrupt Enable for Ethernet Wakeup through EXTI line interrupt global interrupt. */
#define NVIC_ISER1_ETH_WKUP      ((u32) 0x40000000)
/** Interrupt Enable for CAN2 TX interrupts global interrupt. */
#define NVIC_ISER1_CAN2_TX       ((u32) 0x80000000)
/** Interrupt Enable for CAN2 RX0 interrupts global interrupt. */
#define NVIC_ISER2_CAN2_RX0      ((u32) 0x00000001)
/** Interrupt Enable for CAN2 RX1 interrupt global interrupt. */
#define NVIC_ISER2_CAN2_RX1      ((u32) 0x00000002)
/** Interrupt Enable for CAN2 SCE interrupt global interrupt. */
#define NVIC_ISER2_CAN2_SCE      ((u32) 0x00000004)
/** Interrupt Enable for USB On The Go FS global interrupt global interrupt. */
#define NVIC_ISER2_OTG_FS        ((u32) 0x00000008)

/* Indices into the NVIC->IP array of u8 priorities. */

/** Interrupt Priority Address for Window Watchdog interrupt global interrupt. */
#define NVIC_IP_INDEX_WWDG          ((u8) 0)
/** Interrupt Priority Address for PVD through EXTI Line detection interrupt global interrupt. */
#define NVIC_IP_INDEX_PVD           ((u8) 1)
/** Interrupt Priority Address for Tamper interrupt global interrupt. */
#define NVIC_IP_INDEX_TAMPER        ((u8) 2)
/** Interrupt Priority Address for RTC global interrupt global interrupt. */
#define NVIC_IP_INDEX_RTC           ((u8) 3)
/** Interrupt Priority Address for Flash global interrupt global interrupt. */
#define NVIC_IP_INDEX_FLASH         ((u8) 4)
/** Interrupt Priority Address for RCC global interrupt global interrupt. */
#define NVIC_IP_INDEX_RCC           ((u8) 5)
/** Interrupt Priority Address for EXTI Line0 interrupt global interrupt. */
#define NVIC_IP_INDEX_EXTI0         ((u8) 6)
/** Interrupt Priority Address for EXTI Line1 interrupt global interrupt. */
#define NVIC_IP_INDEX_EXTI1         ((u8) 7)
/** Interrupt Priority Address for EXTI Line2 interrupt global interrupt. */
#define NVIC_IP_INDEX_EXTI2         ((u8) 8)
/** Interrupt Priority Address for EXTI Line3 interrupt global interrupt. */
#define NVIC_IP_INDEX_EXTI3         ((u8) 9)
/** Interrupt Priority Address for EXTI Line4 interrupt global interrupt. */
#define NVIC_IP_INDEX_EXTI4         ((u8) 10)
/** Interrupt Priority Address for DMA1 Channel1 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel1 ((u8) 11)
/** Interrupt Priority Address for DMA1 Channel2 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel2 ((u8) 12)
/** Interrupt Priority Address for DMA1 Channel3 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel3 ((u8) 13)
/** Interrupt Priority Address for DMA1 Channel4 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel4 ((u8) 14)
/** Interrupt Priority Address for DMA1 Channel5 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel5 ((u8) 15)
/** Interrupt Priority Address for DMA1 Channel6 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel6 ((u8) 16)
/** Interrupt Priority Address for DMA1 Channel7 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel7 ((u8) 17)
/** Interrupt Priority Address for ADC1 and ADC2 global interrupt global interrupt. */
#define NVIC_IP_INDEX_ADC1_2        ((u8) 18)
/** Interrupt Priority Address for CAN1 TX interrupts global interrupt. */
#define NVIC_IP_INDEX_CAN1_TX       ((u8) 19)
/** Interrupt Priority Address for CAN1 RX0 interrupts global interrupt. */
#define NVIC_IP_INDEX_CAN1_RX0      ((u8) 20)
/** Interrupt Priority Address for CAN1 RX1 interrupt global interrupt. */
#define NVIC_IP_INDEX_CAN1_RX1      ((u8) 21)
/** Interrupt Priority Address for CAN1 SCE interrupt global interrupt. */
#define NVIC_IP_INDEX_CAN1_SCE      ((u8) 22)
/** Interrupt Priority Address for EXTI Line[9:5] interrupts global interrupt. */
#define NVIC_IP_INDEX_EXTI9_5       ((u8) 23)
/** Interrupt Priority Address for TIM1 Break interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM1_BRK      ((u8) 24)
/** Interrupt Priority Address for TIM1 Update interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM1_UP       ((u8) 25)
/** Interrupt Priority Address for TIM1 Trigger and Commutation interrupts global interrupt. */
#define NVIC_IP_INDEX_TIM1_TRG_COM  ((u8) 26)
/** Interrupt Priority Address for TIM1 Capture Compare interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM1_CC       ((u8) 27)
/** Interrupt Priority Address for TIM2 global interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM2          ((u8) 28)
/** Interrupt Priority Address for TIM3 global interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM3          ((u8) 29)
/** Interrupt Priority Address for TIM4 global interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM4          ((u8) 30)
/** Interrupt Priority Address for I2C1 event interrupt global interrupt. */
#define NVIC_IP_INDEX_I2C1_EV       ((u8) 31)
/** Interrupt Priority Address for I2C1 error interrupt global interrupt. */
#define NVIC_IP_INDEX_I2C1_ER       ((u8) 32)
/** Interrupt Priority Address for I2C2 event interrupt global interrupt. */
#define NVIC_IP_INDEX_I2C2_EV       ((u8) 33)
/** Interrupt Priority Address for I2C2 error interrupt global interrupt. */
#define NVIC_IP_INDEX_I2C2_ER       ((u8) 34)
/** Interrupt Priority Address for SPI1 global interrupt global interrupt. */
#define NVIC_IP_INDEX_SPI1          ((u8) 35)
/** Interrupt Priority Address for SPI2 global interrupt global interrupt. */
#define NVIC_IP_INDEX_SPI2          ((u8) 36)
/** Interrupt Priority Address for USART1 global interrupt global interrupt. */
#define NVIC_IP_INDEX_USART1        ((u8) 37)
/** Interrupt Priority Address for USART2 global interrupt global interrupt. */
#define NVIC_IP_INDEX_USART2        ((u8) 38)
/** Interrupt Priority Address for USART3 global interrupt global interrupt. */
#define NVIC_IP_INDEX_USART3        ((u8) 39)
/** Interrupt Priority Address for EXTI Line[15:10] interrupts global interrupt. */
#define NVIC_IP_INDEX_EXTI15_10     ((u8) 40)
/** Interrupt Priority Address for RTC alarm through EXTI line interrupt global interrupt. */
#define NVIC_IP_INDEX_RTCAlarm      ((u8) 41)
/** Interrupt Priority Address for USB On-The-Go FS Wakeup through EXTI line interrupt global interrupt. */
#define NVIC_IP_INDEX_OTG_FS_WKUP   ((u8) 42)
/* RESERVED SPACE HERE */
/** Interrupt Priority Address for TIM5 global interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM5          ((u8) 50)
/** Interrupt Priority Address for SPI3 global interrupt global interrupt. */
#define NVIC_IP_INDEX_SPI3          ((u8) 51)
/** Interrupt Priority Address for UART4 global interrupt global interrupt. */
#define NVIC_IP_INDEX_UART4         ((u8) 52)
/** Interrupt Priority Address for UART5 global interrupt global interrupt. */
#define NVIC_IP_INDEX_UART5         ((u8) 53)
/** Interrupt Priority Address for TIM6 global interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM6          ((u8) 54)
/** Interrupt Priority Address for TIM7 global interrupt global interrupt. */
#define NVIC_IP_INDEX_TIM7          ((u8) 55)
/** Interrupt Priority Address for DMA2 Channel1 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel1 ((u8) 56)
/** Interrupt Priority Address for DMA2 Channel2 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel2 ((u8) 57)
/** Interrupt Priority Address for DMA2 Channel3 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel3 ((u8) 58)
/** Interrupt Priority Address for DMA2 Channel4 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel4 ((u8) 59)
/** Interrupt Priority Address for DMA2 Channel5 global interrupt global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel5 ((u8) 60)
/** Interrupt Priority Address for Ethernet global interrupt global interrupt. */
#define NVIC_IP_INDEX_ETH           ((u8) 61)
/** Interrupt Priority Address for Ethernet Wakeup through EXTI line interrupt global interrupt. */
#define NVIC_IP_INDEX_ETH_WKUP      ((u8) 62)
/** Interrupt Priority Address for CAN2 TX interrupts global interrupt. */
#define NVIC_IP_INDEX_CAN2_TX       ((u8) 63)
/** Interrupt Priority Address for CAN2 RX0 interrupts global interrupt. */
#define NVIC_IP_INDEX_CAN2_RX0      ((u8) 64)
/** Interrupt Priority Address for CAN2 RX1 interrupt global interrupt. */
#define NVIC_IP_INDEX_CAN2_RX1      ((u8) 65)
/** Interrupt Priority Address for CAN2 SCE interrupt global interrupt. */
#define NVIC_IP_INDEX_CAN2_SCE      ((u8) 66)
/** Interrupt Priority Address for USB On The Go FS global interrupt global interrupt. */
#define NVIC_IP_INDEX_OTG_FS        ((u8) 67)

#elif defined(STM32F10X_XL) /* XL-density devices */

