vigneswaranj/UnityKeilSTM32/CMSIS/Headers/STM32Defs.h
/* NVIC Enable Register Numbers and Bit Patterns. */
/** Interrupt Enable for Window Watchdog interrupt. */
#define NVIC_ISER0_WWDG            ((u32) 0x00000001)
/** Interrupt Enable for PVD through EXTI Line detection interrupt. */
#define NVIC_ISER0_PVD             ((u32) 0x00000002)
/** Interrupt Enable for Tamper interrupt. */
#define NVIC_ISER0_TAMPER          ((u32) 0x00000004)
/** Interrupt Enable for RTC global interrupt. */
#define NVIC_ISER0_RTC             ((u32) 0x00000008)
/** Interrupt Enable for Flash global interrupt. */
#define NVIC_ISER0_FLASH           ((u32) 0x00000010)
/** Interrupt Enable for RCC global interrupt. */
#define NVIC_ISER0_RCC             ((u32) 0x00000020)
/** Interrupt Enable for EXTI Line0 interrupt. */
#define NVIC_ISER0_EXTI0           ((u32) 0x00000040)
/** Interrupt Enable for EXTI Line1 interrupt. */
#define NVIC_ISER0_EXTI1           ((u32) 0x00000080)
/** Interrupt Enable for EXTI Line2 interrupt. */
#define NVIC_ISER0_EXTI2           ((u32) 0x00000100)
/** Interrupt Enable for EXTI Line3 interrupt. */
#define NVIC_ISER0_EXTI3           ((u32) 0x00000200)
/** Interrupt Enable for EXTI Line4 interrupt. */
#define NVIC_ISER0_EXTI4           ((u32) 0x00000400)
/** Interrupt Enable for DMA Channel1 global interrupt. */
#define NVIC_ISER0_DMA_Channel1    ((u32) 0x00000800)
#define NVIC_ISER0_DMA1_Channel1   ((u32) 0x00000800)
/** Interrupt Enable for DMA Channel2 global interrupt. */
#define NVIC_ISER0_DMA_Channel2    ((u32) 0x00001000)
#define NVIC_ISER0_DMA1_Channel2   ((u32) 0x00001000)
/** Interrupt Enable for DMA Channel3 global interrupt. */
#define NVIC_ISER0_DMA_Channel3    ((u32) 0x00002000)
#define NVIC_ISER0_DMA1_Channel3   ((u32) 0x00002000)
/** Interrupt Enable for DMA Channel4 global interrupt. */
#define NVIC_ISER0_DMA_Channel4    ((u32) 0x00004000)
#define NVIC_ISER0_DMA1_Channel4   ((u32) 0x00004000)
/** Interrupt Enable for DMA Channel5 global interrupt. */
#define NVIC_ISER0_DMA_Channel5    ((u32) 0x00008000)
#define NVIC_ISER0_DMA1_Channel5   ((u32) 0x00008000)
/** Interrupt Enable for DMA Channel6 global interrupt. */
#define NVIC_ISER0_DMA_Channel6    ((u32) 0x00010000)
#define NVIC_ISER0_DMA1_Channel6   ((u32) 0x00010000)
/** Interrupt Enable for DMA Channel7 global interrupt. */
#define NVIC_ISER0_DMA_Channel7    ((u32) 0x00020000)
#define NVIC_ISER0_DMA1_Channel7   ((u32) 0x00020000)
/** Interrupt Enable for ADC1 and ADC2 global interrupt. */
#define NVIC_ISER0_ADC1_2          ((u32) 0x00040000)
/** Interrupt Enable for USB High Priority or CAN TX interrupts. */
#define NVIC_ISER0_USB_HP_CAN_TX   ((u32) 0x00080000)
/** Interrupt Enable for USB Low Priority or CAN RX0 interrupts. */
#define NVIC_ISER0_USB_LP_CAN_RX0  ((u32) 0x00100000)
/** Interrupt Enable for CAN RX1 interrupt. */
#define NVIC_ISER0_CAN_RX1         ((u32) 0x00200000)
/** Interrupt Enable for CAN SCE interrupt. */
#define NVIC_ISER0_CAN_SCE         ((u32) 0x00400000)
/** Interrupt Enable for EXTI Line[9:5] interrupts. */
#define NVIC_ISER0_EXTI9_5         ((u32) 0x00800000)
/** Interrupt Enable for TIM1 Break interrupt and TIM9 global interrupt. */
#define NVIC_ISER0_TIM1_BRK_TIM9   ((u32) 0x01000000)
/** Interrupt Enable for TIM1 Update interrupt and TIM10 global interrupt. */
#define NVIC_ISER0_TIM1_UP_TIM10   ((u32) 0x02000000)
/** Interrupt Enable for TIM1 Trigger and Commutation interrupts and TIM11 global interrupt. */
#define NVIC_ISER0_TIM1_TRG_COM_TIM11 ((u32) 0x04000000)
/** Interrupt Enable for TIM1 Capture Compare interrupt. */
#define NVIC_ISER0_TIM1_CC         ((u32) 0x08000000)
/** Interrupt Enable for TIM2 global interrupt. */
#define NVIC_ISER0_TIM2            ((u32) 0x10000000)
/** Interrupt Enable for TIM3 global interrupt. */
#define NVIC_ISER0_TIM3            ((u32) 0x20000000)
/** Interrupt Enable for TIM4 global interrupt. */
#define NVIC_ISER0_TIM4            ((u32) 0x40000000)
/** Interrupt Enable for I2C1 event interrupt. */
#define NVIC_ISER0_I2C1_EV         ((u32) 0x80000000)
/** Interrupt Enable for I2C1 error interrupt. */
#define NVIC_ISER1_I2C1_ER         ((u32) 0x00000001)
/** Interrupt Enable for I2C2 event interrupt. */
#define NVIC_ISER1_I2C2_EV         ((u32) 0x00000002)
/** Interrupt Enable for I2C2 error interrupt. */
#define NVIC_ISER1_I2C2_ER         ((u32) 0x00000004)
/** Interrupt Enable for SPI1 global interrupt. */
#define NVIC_ISER1_SPI1            ((u32) 0x00000008)
/** Interrupt Enable for SPI2 global interrupt. */
#define NVIC_ISER1_SPI2            ((u32) 0x00000010)
/** Interrupt Enable for USART1 global interrupt. */
#define NVIC_ISER1_USART1          ((u32) 0x00000020)
/** Interrupt Enable for USART2 global interrupt. */
#define NVIC_ISER1_USART2          ((u32) 0x00000040)
/** Interrupt Enable for USART3 global interrupt. */
#define NVIC_ISER1_USART3          ((u32) 0x00000080)
/** Interrupt Enable for EXTI Line[15:10] interrupts. */
#define NVIC_ISER1_EXTI15_10       ((u32) 0x00000100)
/** Interrupt Enable for RTC alarm through EXTI line interrupt. */
#define NVIC_ISER1_RTCAlarm        ((u32) 0x00000200)
/** Interrupt Enable for USB wakeup from suspend through EXTI line interrupt. */
#define NVIC_ISER1_USBWakeup       ((u32) 0x00000400)
/** Interrupt Enable for TIM8 Break interrupt and TIM12 global interrupt. */
#define NVIC_ISER1_TIM8_BRK_TIM12  ((u32) 0x00000800)
/** Interrupt Enable for TIM8 Update interrupt and TIM13 global interrupt. */
#define NVIC_ISER1_TIM8_UP_TIM13   ((u32) 0x00001000)
/** Interrupt Enable for TIM8 Trigger and Commutation interrupts and TIM14 global interrupt. */
#define NVIC_ISER1_TIM8_TRG_COM_TIM14 ((u32) 0x00002000)
/** Interrupt Enable for TIM8 Capture Compare interrupt. */
#define NVIC_ISER1_TIM8_CC         ((u32) 0x00004000)
/** Interrupt Enable for ADC3 global interrupt. */
#define NVIC_ISER1_ADC3            ((u32) 0x00008000)
/** Interrupt Enable for FSMC global interrupt. */
#define NVIC_ISER1_FSMC            ((u32) 0x00010000)
/** Interrupt Enable for SDIO global interrupt. */
#define NVIC_ISER1_SDIO            ((u32) 0x00020000)
/** Interrupt Enable for TIM5 global interrupt. */
#define NVIC_ISER1_TIM5            ((u32) 0x00040000)
/** Interrupt Enable for SPI3 global interrupt. */
#define NVIC_ISER1_SPI3            ((u32) 0x00080000)
/** Interrupt Enable for UART4 global interrupt. */
#define NVIC_ISER1_UART4           ((u32) 0x00100000)
/** Interrupt Enable for UART5 global interrupt. */
#define NVIC_ISER1_UART5           ((u32) 0x00200000)
/** Interrupt Enable for TIM6 global interrupt. */
#define NVIC_ISER1_TIM6            ((u32) 0x00400000)
/** Interrupt Enable for TIM7 global interrupt. */
#define NVIC_ISER1_TIM7            ((u32) 0x00800000)
/** Interrupt Enable for DMA2 Channel1 global interrupt. */
#define NVIC_ISER1_DMA2_Channel1   ((u32) 0x01000000)
/** Interrupt Enable for DMA2 Channel2 global interrupt. */
#define NVIC_ISER1_DMA2_Channel2   ((u32) 0x02000000)
/** Interrupt Enable for DMA2 Channel3 global interrupt. */
#define NVIC_ISER1_DMA2_Channel3   ((u32) 0x04000000)
/** Interrupt Enable for DMA2 Channel4 and DMA2 Channel5 global interrupts. */
#define NVIC_ISER1_DMA2_Channel4_5 ((u32) 0x08000000)

/* Indices into the NVIC->IP array of u8 priorities. */

