vigneswaranj/UnityKeilSTM32/CMSIS/Headers/STM32Defs.h
/** Interrupt Priority Address for Window watchdog interrupt. */
#define NVIC_IP_INDEX_WWDG            ((u8) 0)
/** Interrupt Priority Address for PVD through EXTI Line detection interrupt. */
#define NVIC_IP_INDEX_PVD             ((u8) 1)
/** Interrupt Priority Address for Tamper interrupt. */
#define NVIC_IP_INDEX_TAMPER          ((u8) 2)
/** Interrupt Priority Address for RTC global interrupt. */
#define NVIC_IP_INDEX_RTC             ((u8) 3)
/** Interrupt Priority Address for Flash global interrupt. */
#define NVIC_IP_INDEX_FLASH           ((u8) 4)
/** Interrupt Priority Address for RCC global interrupt. */
#define NVIC_IP_INDEX_RCC             ((u8) 5)
/** Interrupt Priority Address for EXTI Line0 interrupt. */
#define NVIC_IP_INDEX_EXTI0           ((u8) 6)
/** Interrupt Priority Address for EXTI Line1 interrupt. */
#define NVIC_IP_INDEX_EXTI1           ((u8) 7)
/** Interrupt Priority Address for EXTI Line2 interrupt. */
#define NVIC_IP_INDEX_EXTI2           ((u8) 8)
/** Interrupt Priority Address for EXTI Line3 interrupt. */
#define NVIC_IP_INDEX_EXTI3           ((u8) 9)
/** Interrupt Priority Address for EXTI Line4 interrupt. */
#define NVIC_IP_INDEX_EXTI4           ((u8) 10)
/** Interrupt Priority Address for DMA1 Channel1 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel1   ((u8) 11)
#define NVIC_IP_INDEX_DMA_Channel1    ((u8) 11)
/** Interrupt Priority Address for DMA1 Channel2 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel2   ((u8) 12)
#define NVIC_IP_INDEX_DMA_Channel2    ((u8) 12)
/** Interrupt Priority Address for DMA1 Channel3 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel3   ((u8) 13)
#define NVIC_IP_INDEX_DMA_Channel3    ((u8) 13)
/** Interrupt Priority Address for DMA1 Channel4 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel4   ((u8) 14)
#define NVIC_IP_INDEX_DMA_Channel4    ((u8) 14)
/** Interrupt Priority Address for DMA1 Channel5 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel5   ((u8) 15)
#define NVIC_IP_INDEX_DMA_Channel5    ((u8) 15)
/** Interrupt Priority Address for DMA1 Channel6 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel6   ((u8) 16)
#define NVIC_IP_INDEX_DMA_Channel6    ((u8) 16)
/** Interrupt Priority Address for DMA1 Channel7 global interrupt. */
#define NVIC_IP_INDEX_DMA1_Channel7   ((u8) 17)
#define NVIC_IP_INDEX_DMA_Channel7    ((u8) 17)
/** Interrupt Priority Address for ADC1 and ADC2 global interrupt. */
#define NVIC_IP_INDEX_ADC1_2          ((u8) 18)
/** Interrupt Priority Address for USB High Priority or CAN TX interrupts. */
#define NVIC_IP_INDEX_USB_HP_CAN_TX   ((u8) 19)
/** Interrupt Priority Address for USB Low Priority or CAN RX0 interrupts. */
#define NVIC_IP_INDEX_USB_LP_CAN_RX0  ((u8) 20)
/** Interrupt Priority Address for CAN RX1 interrupt. */
#define NVIC_IP_INDEX_CAN_RX1         ((u8) 21)
/** Interrupt Priority Address for CAN SCE interrupt. */
#define NVIC_IP_INDEX_CAN_SCE         ((u8) 22)
/** Interrupt Priority Address for EXTI Line[9:5] interrupts. */
#define NVIC_IP_INDEX_EXTI9_5         ((u8) 23)
/** Interrupt Priority Address for TIM1 Break interrupt. */
#define NVIC_IP_INDEX_TIM1_BRK        ((u8) 24)
/** Interrupt Priority Address for TIM1 Update interrupt. */
#define NVIC_IP_INDEX_TIM1_UP         ((u8) 25)
/** Interrupt Priority Address for TIM1 Trigger and Commutation interrupts. */
#define NVIC_IP_INDEX_TIM1_TRG_COM    ((u8) 26)
/** Interrupt Priority Address for TIM1 Capture Compare interrupt. */
#define NVIC_IP_INDEX_TIM1_CC         ((u8) 27)
/** Interrupt Priority Address for TIM2 global interrupt. */
#define NVIC_IP_INDEX_TIM2            ((u8) 28)
/** Interrupt Priority Address for TIM3 global interrupt. */
#define NVIC_IP_INDEX_TIM3            ((u8) 29)
/** Interrupt Priority Address for TIM4 global interrupt. */
#define NVIC_IP_INDEX_TIM4            ((u8) 30)
/** Interrupt Priority Address for I2C1 event interrupt. */
#define NVIC_IP_INDEX_I2C1_EV         ((u8) 31)
/** Interrupt Priority Address for I2C1 error interrupt. */
#define NVIC_IP_INDEX_I2C1_ER         ((u8) 32)
/** Interrupt Priority Address for I2C2 event interrupt. */
#define NVIC_IP_INDEX_I2C2_EV         ((u8) 33)
/** Interrupt Priority Address for I2C2 error interrupt. */
#define NVIC_IP_INDEX_I2C2_ER         ((u8) 34)
/** Interrupt Priority Address for SPI1 global interrupt. */
#define NVIC_IP_INDEX_SPI1            ((u8) 35)
/** Interrupt Priority Address for SPI2 global interrupt. */
#define NVIC_IP_INDEX_SPI2            ((u8) 36)
/** Interrupt Priority Address for USART1 global interrupt. */
#define NVIC_IP_INDEX_USART1          ((u8) 37)
/** Interrupt Priority Address for USART2 global interrupt. */
#define NVIC_IP_INDEX_USART2          ((u8) 38)
/** Interrupt Priority Address for USART3 global interrupt. */
#define NVIC_IP_INDEX_USART3          ((u8) 39)
/** Interrupt Priority Address for EXTI Line[15:10] interrupts. */
#define NVIC_IP_INDEX_EXTI15_10       ((u8) 40)
/** Interrupt Priority Address for RTC alarm through EXTI line interrupt. */
#define NVIC_IP_INDEX_RTCAlarm        ((u8) 41)
/** Interrupt Priority Address for USB wakeup from suspend through EXTI line interrupt. */
#define NVIC_IP_INDEX_USBWakeup       ((u8) 42)
/** Interrupt Priority Address for TIM8 Break interrupt. */
#define NVIC_IP_INDEX_TIM8_BRK        ((u8) 43)
/** Interrupt Priority Address for TIM8 Update interrupt. */
#define NVIC_IP_INDEX_TIM8_UP         ((u8) 44)
/** Interrupt Priority Address for TIM8 Trigger and Commutation interrupts. */
#define NVIC_IP_INDEX_TIM8_TRG_COM    ((u8) 45)
/** Interrupt Priority Address for TIM8 Capture Compare interrupt. */
#define NVIC_IP_INDEX_TIM8_CC         ((u8) 46)
/** Interrupt Priority Address for ADC3 global interrupt. */
#define NVIC_IP_INDEX_ADC3            ((u8) 47)
/** Interrupt Priority Address for FSMC global interrupt. */
#define NVIC_IP_INDEX_FSMC            ((u8) 48)
/** Interrupt Priority Address for SDIO global interrupt. */
#define NVIC_IP_INDEX_SDIO            ((u8) 49)
/** Interrupt Priority Address for TIM5 global interrupt. */
#define NVIC_IP_INDEX_TIM5            ((u8) 50)
/** Interrupt Priority Address for SPI3 global interrupt. */
#define NVIC_IP_INDEX_SPI3            ((u8) 51)
/** Interrupt Priority Address for UART4 global interrupt. */
#define NVIC_IP_INDEX_UART4           ((u8) 52)
/** Interrupt Priority Address for UART5 global interrupt. */
#define NVIC_IP_INDEX_UART5           ((u8) 53)
/** Interrupt Priority Address for TIM6 global interrupt. */
#define NVIC_IP_INDEX_TIM6            ((u8) 54)
/** Interrupt Priority Address for TIM7 global interrupt. */
#define NVIC_IP_INDEX_TIM7            ((u8) 55)
/** Interrupt Priority Address for DMA2 Channel1 global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel1   ((u8) 56)
/** Interrupt Priority Address for DMA2 Channel2 global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel2   ((u8) 57)
/** Interrupt Priority Address for DMA2 Channel3 global interrupt. */
#define NVIC_IP_INDEX_DMA2_Channel3   ((u8) 58)
/** Interrupt Priority Address for DMA2 Channel4 and DMA2 Channel5 global interrupts. */
#define NVIC_IP_INDEX_DMA2_Channel4_5 ((u8) 59)

#endif

/* --------------------------------------------------------------- */
/* DMA */


#define DMA_CCR1_PL_Low       (u32) 0x00000000
#define DMA_CCR1_PL_Medium    DMA_CCR1_PL_0
#define DMA_CCR1_PL_High      DMA_CCR1_PL_1
#define DMA_CCR1_PL_VeryHigh  (DMA_CCR1_PL_1 | DMA_CCR1_PL_0)

#define DMA_CCR1_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR1_MSIZE_16bits DMA_CCR1_MSIZE_0
#define DMA_CCR1_MSIZE_32bits DMA_CCR1_MSIZE_1

#define DMA_CCR1_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR1_PSIZE_16bits DMA_CCR1_PSIZE_0
#define DMA_CCR1_PSIZE_32bits DMA_CCR1_PSIZE_1

#define DMA_CCR2_PL_Low       (u32) 0x00000000
#define DMA_CCR2_PL_Medium    DMA_CCR2_PL_0
#define DMA_CCR2_PL_High      DMA_CCR2_PL_1
#define DMA_CCR2_PL_VeryHigh  (DMA_CCR2_PL_1 | DMA_CCR2_PL_0)

