vigneswaranj/UnityKeilSTM32/CMSIS/Headers/STM32Defs.h
#define DMA_CCR2_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR2_MSIZE_16bits DMA_CCR2_MSIZE_0
#define DMA_CCR2_MSIZE_32bits DMA_CCR2_MSIZE_1

#define DMA_CCR2_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR2_PSIZE_16bits DMA_CCR2_PSIZE_0
#define DMA_CCR2_PSIZE_32bits DMA_CCR2_PSIZE_1

#define DMA_CCR3_PL_Low       (u32) 0x00000000
#define DMA_CCR3_PL_Medium    DMA_CCR3_PL_0
#define DMA_CCR3_PL_High      DMA_CCR3_PL_1
#define DMA_CCR3_PL_VeryHigh  (DMA_CCR3_PL_1 | DMA_CCR3_PL_0)

#define DMA_CCR3_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR3_MSIZE_16bits DMA_CCR3_MSIZE_0
#define DMA_CCR3_MSIZE_32bits DMA_CCR3_MSIZE_1

#define DMA_CCR3_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR3_PSIZE_16bits DMA_CCR3_PSIZE_0
#define DMA_CCR3_PSIZE_32bits DMA_CCR3_PSIZE_1

#define DMA_CCR4_PL_Low       (u32) 0x00000000
#define DMA_CCR4_PL_Medium    DMA_CCR4_PL_0
#define DMA_CCR4_PL_High      DMA_CCR4_PL_1
#define DMA_CCR4_PL_VeryHigh  (DMA_CCR4_PL_1 | DMA_CCR4_PL_0)

#define DMA_CCR4_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR4_MSIZE_16bits DMA_CCR4_MSIZE_0
#define DMA_CCR4_MSIZE_32bits DMA_CCR4_MSIZE_1

#define DMA_CCR4_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR4_PSIZE_16bits DMA_CCR4_PSIZE_0
#define DMA_CCR4_PSIZE_32bits DMA_CCR4_PSIZE_1

#define DMA_CCR5_PL_Low       (u32) 0x00000000
#define DMA_CCR5_PL_Medium    DMA_CCR5_PL_0
#define DMA_CCR5_PL_High      DMA_CCR5_PL_1
#define DMA_CCR5_PL_VeryHigh  (DMA_CCR5_PL_1 | DMA_CCR5_PL_0)

#define DMA_CCR5_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR5_MSIZE_16bits DMA_CCR5_MSIZE_0
#define DMA_CCR5_MSIZE_32bits DMA_CCR5_MSIZE_1

#define DMA_CCR5_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR5_PSIZE_16bits DMA_CCR5_PSIZE_0
#define DMA_CCR5_PSIZE_32bits DMA_CCR5_PSIZE_1

#define DMA_CCR6_PL_Low       (u32) 0x00000000
#define DMA_CCR6_PL_Medium    DMA_CCR6_PL_0
#define DMA_CCR6_PL_High      DMA_CCR6_PL_1
#define DMA_CCR6_PL_VeryHigh  (DMA_CCR6_PL_1 | DMA_CCR6_PL_0)

#define DMA_CCR6_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR6_MSIZE_16bits DMA_CCR6_MSIZE_0
#define DMA_CCR6_MSIZE_32bits DMA_CCR6_MSIZE_1

#define DMA_CCR6_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR6_PSIZE_16bits DMA_CCR6_PSIZE_0
#define DMA_CCR6_PSIZE_32bits DMA_CCR6_PSIZE_1

#define DMA_CCR7_PL_Low       (u32) 0x00000000
#define DMA_CCR7_PL_Medium    DMA_CCR7_PL_0
#define DMA_CCR7_PL_High      DMA_CCR7_PL_1
#define DMA_CCR7_PL_VeryHigh  (DMA_CCR7_PL_1 | DMA_CCR7_PL_0)

#define DMA_CCR7_MSIZE_8bits  (u32) 0x00000000
#define DMA_CCR7_MSIZE_16bits DMA_CCR7_MSIZE_0
#define DMA_CCR7_MSIZE_32bits DMA_CCR7_MSIZE_1

#define DMA_CCR7_PSIZE_8bits  (u32) 0x00000000
#define DMA_CCR7_PSIZE_16bits DMA_CCR7_PSIZE_0
#define DMA_CCR7_PSIZE_32bits DMA_CCR7_PSIZE_1

/* --------------------------------------------------------------- */
/* Timers. (Timer 1 has some bits unique to it) */

/* TIMx_CR1: Control register 1 */

#define TIM_CR1_CKD_Div1  (u16) 0x0000
#define TIM_CR1_CKD_Div2  TIM_CR1_CKD_0
#define TIM_CR1_CKD_Div4  TIM_CR1_CKD_1

#define TIM_CR2_MMS_Reset       (u16) 0
#define TIM_CR2_MMS_Enable      TIM_CR2_MMS_0
#define TIM_CR2_MMS_Update      TIM_CR2_MMS_1
#define TIM_CR2_MMS_CmpPulse    (TIM_CR2_MMS_1 | TIM_CR2_MMS_0)
#define TIM_CR2_MMS_CmpOC1REF   TIM_CR2_MMS_2
#define TIM_CR2_MMS_CmpOC2REF   (TIM_CR2_MMS_2 | TIM_CR2_MMS_0)
#define TIM_CR2_MMS_CmpOC3REF   (TIM_CR2_MMS_2 | TIM_CR2_MMS_1)
#define TIM_CR2_MMS_CmpOC4REF   (TIM_CR2_MMS_2 | TIM_CR2_MMS_1 | TIM_CR2_MMS_0)

/* OCxM: output compare mode */
#define TIM_CCMR1_OC1M_Frozen   (u16) 0x0000
#define TIM_CCMR1_OC1M_ActiveOnMatch   (TIM_CCMR1_OC1M_0)
#define TIM_CCMR1_OC1M_InactiveOnMatch (TIM_CCMR1_OC1M_1)
#define TIM_CCMR1_OC1M_ToggleOnMatch   (TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0)
#define TIM_CCMR1_OC1M_ForceInactive   (TIM_CCMR1_OC1M_2)
#define TIM_CCMR1_OC1M_ForceActive     (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_0)
#define TIM_CCMR1_OC1M_PWM1            (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1)
#define TIM_CCMR1_OC1M_PWM2            (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0)

#define TIM_CCMR1_OC2M_Frozen          ((u16) 0x0000)
#define TIM_CCMR1_OC2M_ActiveOnMatch   (TIM_CCMR1_OC2M_0)
#define TIM_CCMR1_OC2M_InactiveOnMatch (TIM_CCMR1_OC2M_1)
#define TIM_CCMR1_OC2M_ToggleOnMatch   (TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2M_0)
#define TIM_CCMR1_OC2M_ForceInactive   (TIM_CCMR1_OC2M_2)
#define TIM_CCMR1_OC2M_ForceActive     (TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_0)
#define TIM_CCMR1_OC2M_PWM1            (TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_1)
#define TIM_CCMR1_OC2M_PWM2            (TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2M_0)

/* CCxS: capture/compare selection */
#define TIM_CCMR1_CC2S_Output   (u16) 0x0000
#define TIM_CCMR1_CC2S_InputTI2 TIM_CCMR1_CC2S_0
#define TIM_CCMR1_CC2S_InputTI1 TIM_CCMR1_CC2S_1
#define TIM_CCMR1_CC2S_InputTRC (TIM_CCMR1_CC2S_1 | TIM_CCMR1_CC2S_0)

#define TIM_CCMR1_CC1S_Output   (u16) 0x0000
#define TIM_CCMR1_CC1S_InputTI1 TIM_CCMR1_CC1S_0
#define TIM_CCMR1_CC1S_InputTI2 TIM_CCMR1_CC1S_1
#define TIM_CCMR1_CC1S_InputTRC (TIM_CCMR1_CC1S_1 | TIM_CCMR1_CC1S_0)


#define TIM_CCMR2_OC3M_Frozen          ((u16) 0x0000)
#define TIM_CCMR2_OC3M_ActiveOnMatch   (TIM_CCMR2_OC3M_0)
#define TIM_CCMR2_OC3M_InactiveOnMatch (TIM_CCMR2_OC3M_1)
#define TIM_CCMR2_OC3M_ToggleOnMatch   (TIM_CCMR2_OC3M_1 | TIM_CCMR2_OC3M_0)
#define TIM_CCMR2_OC3M_ForceInactive   (TIM_CCMR2_OC3M_2)
#define TIM_CCMR2_OC3M_ForceActive     (TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3M_0)
#define TIM_CCMR2_OC3M_PWM1            (TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3M_1)
#define TIM_CCMR2_OC3M_PWM2            (TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3M_1 | TIM_CCMR2_OC3M_0)

#define TIM_CCMR2_OC4M_Frozen   (u16) 0x0000
#define TIM_CCMR2_OC4M_ActiveOnMatch   (TIM_CCMR2_OC4M_0)
#define TIM_CCMR2_OC4M_InactiveOnMatch (TIM_CCMR2_OC4M_1)
#define TIM_CCMR2_OC4M_ToggleOnMatch   (TIM_CCMR2_OC4M_1 | TIM_CCMR2_OC4M_0)
#define TIM_CCMR2_OC4M_ForceInactive   (TIM_CCMR2_OC4M_2)
#define TIM_CCMR2_OC4M_ForceActive     (TIM_CCMR2_OC4M_2 | TIM_CCMR2_OC4M_0)
#define TIM_CCMR2_OC4M_PWM1            (TIM_CCMR2_OC4M_2 | TIM_CCMR2_OC4M_1)
#define TIM_CCMR2_OC4M_PWM2            (TIM_CCMR2_OC4M_2 | TIM_CCMR2_OC4M_1 | TIM_CCMR2_OC4M_0)

#define TIM_CCMR2_CC3S_Output   (u16) 0x0000
#define TIM_CCMR2_CC3S_InputTI3 TIM_CCMR2_CC3S_0
#define TIM_CCMR2_CC3S_InputTI4 TIM_CCMR2_CC3S_1
#define TIM_CCMR2_CC3S_InputTRC (TIM_CCMR2_CC3S_1 | TIM_CCMR2_CC3S_0)

#define TIM_CCMR2_CC4S_Output   (u16) 0x0000
#define TIM_CCMR2_CC4S_InputTI4 TIM_CCMR2_CC4S_0
#define TIM_CCMR2_CC4S_InputTI3 TIM_CCMR2_CC4S_1
#define TIM_CCMR2_CC4S_InputTRC (TIM_CCMR2_CC4S_1 | TIM_CCMR2_CC4S_0)


#define ADC_CR1_DISCNUM0(u3Data) (u32) ((u32) 0x0000E000 & (((u32) (u5Data)) << 13))


/* ADC 1&2 regular external triggers */
#define ADC_CR2_EXTSEL_T1CC1        (u32) 0
#define ADC_CR2_EXTSEL_T1CC2        ADC_CR2_EXTSEL_0
#define ADC_CR2_EXTSEL_T1CC3        ADC_CR2_EXTSEL_1
#define ADC_CR2_EXTSEL_T2CC2        (ADC_CR2_EXTSEL_1 | ADC_CR2_EXTSEL_0)
#define ADC_CR2_EXTSEL_T3TRGO       ADC_CR2_EXTSEL_2
#define ADC_CR2_EXTSEL_T4CC4        (ADC_CR2_EXTSEL_2 | ADC_CR2_EXTSEL_0)
#define ADC_CR2_EXTSEL_EXTI11_T8TRGO   (ADC_CR2_EXTSEL_2 | ADC_CR2_EXTSEL_1)
#define ADC_CR2_EXTSEL_SWSTART      (ADC_CR2_EXTSEL_2 | ADC_CR2_EXTSEL_1 | ADC_CR2_EXTSEL_0)

/* ADC 1&2 injected external triggers */
#define ADC_CR2_JEXTSEL_T1TRGO      (u32) 0
#define ADC_CR2_JEXTSEL_T1CC4       ADC_CR2_JEXTSEL_0
#define ADC_CR2_JEXTSEL_T2TRGO      ADC_CR2_JEXTSEL_1
#define ADC_CR2_JEXTSEL_T2CC1       (ADC_CR2_JEXTSEL_1 | ADC_CR2_JEXTSEL_0)
#define ADC_CR2_JEXTSEL_T3CC4       ADC_CR2_JEXTSEL_2
#define ADC_CR2_JEXTSEL_T4TRGO      (ADC_CR2_JEXTSEL_2 | ADC_CR2_JEXTSEL_0)
#define ADC_CR2_JEXTSEL_EXTI15_T8CC4   (ADC_CR2_JEXTSEL_2 | ADC_CR2_JEXTSEL_1)
#define ADC_CR2_JEXTSEL_JSWSTART    (ADC_CR2_JEXTSEL_2 | ADC_CR2_JEXTSEL_1 | ADC_CR2_JEXTSEL_0)


#define SysTick_CTRL_CLK_AHB     SysTick_CTRL_CLKSOURCE
#define SysTick_CTRL_CLK_AHBDIV8 (u32) 0x00000000

/* Application Interrupt and Reset Control Register; SCB->AIRC; p165 */
#define SCB_AIRCR_VECTKEY_WRITE  (u32) 0x05FA0000

/* SPI Registers */
#define SPI_CR1_BIDIR_ONELINE (u16) 0x8000
#define SPI_CR1_BIDIR_OE      (u16) 0x4000
#define SPI_CR1_CRC_CRCNEXT   (u16) 0x1000
#define SPI_CR1_CRC_DATANEXT  (u16) 0x0000
#define SPI_CR1_DFF_8BIT      (u16) 0x0000
#define SPI_CR1_DFF_16BIT     (u16) 0x0800
#define SPI_CR1_BR_DIV2       (u16) 0x0000
#define SPI_CR1_BR_DIV4       (u16) 0x0008
#define SPI_CR1_BR_DIV8       (u16) 0x0010
#define SPI_CR1_BR_DIV16      (u16) 0x0018
#define SPI_CR1_BR_DIV32      (u16) 0x0020
#define SPI_CR1_BR_DIV64      (u16) 0x0028
#define SPI_CR1_BR_DIV128     (u16) 0x0030
#define SPI_CR1_BR_DIV256     (u16) 0x0038
#define SPI_CR1_MASTER        (u16) 0x0004
#define SPI_CR1_SLAVE         (u16) 0x0000
#define SPI_CR1_MODE_MASK     (u16) 0x0003
#define SPI_CR1_CPOL_HIGH     (u16) 0x0002
#define SPI_CR1_CPHA_HIGH     (u16) 0x0001



/** Flash Key Register (FLASH_KEYR) Unlock Key 1 */
#define FLASH_KEYR_KEY1    ((u32)0x45670123)
/** Flash Key Register (FLASH_KEYR) Unlock Key 2 */
#define FLASH_KEYR_KEY2    ((u32)0xCDEF89AB)
/** Flash read protection disable */
#define OB_RDP_DISABLE     ((u8) 0xA5)
/** Flash read protection enable */
#define OB_RDB_ENABLE      ((u8) 0x00)

