vigneswaranj/UnityKeilSTM32/CMSIS/Headers/STM32Defs.h
/** Slave mode disabled - if CEN = ‘1’ then the prescaler is clocked directly by the internal clock. */
#define TIM_SMCR_SMS_NOSLAVE  ((u16) 0)
/** Encoder mode 1 - Counter counts up/down on TI2FP2 edge depending on TI1FP1 level. */
#define TIM_SMCR_SMS_ENCODER1 ((u16) TIM_SMCR_SMS_0)
/** Encoder mode 2 - Counter counts up/down on TI1FP1 edge depending on TI2FP2 level. */
#define TIM_SMCR_SMS_ENCODER2 ((u16) TIM_SMCR_SMS_1) 
/** Encoder mode 3 - Counter counts up/down on both TI1FP1 and TI2FP2 edges depending on the level of the other input. */
#define TIM_SMCR_SMS_ENCODER3 ((u16) TIM_SMCR_SMS_0 | TIM_SMCR_SMS_1)
/** Reset Mode - Rising edge of the selected trigger input (TRGI) reinitializes the counter and generates an update of the registers. */
#define TIM_SMCR_SMS_RESET    ((u16) TIM_SMCR_SMS_2)
/** Gated Mode - The counter clock is enabled when the trigger input (TRGI) is high. The counter stops (but is not reset) as soon as the trigger becomes low. Both start and stop of the counter are controlled. */
#define TIM_SMCR_SMS_GATED    ((u16) TIM_SMCR_SMS_2 | TIM_SMCR_SMS_0)
/** Trigger Mode - The counter starts at a rising edge of the trigger TRGI (but it is not reset). Only the start of the counter is controlled. */
#define TIM_SMCR_SMS_TRIGGER  ((u16) TIM_SMCR_SMS_2 | TIM_SMCR_SMS_1)
/** External Clock Mode 1 - Rising edges of the selected trigger (TRGI) clock the counter. */
#define TIM_SMCR_SMS_EXTERNAL ((u16) TIM_SMCR_SMS_2 | TIM_SMCR_SMS_1 | TIM_SMCR_SMS_0)

#define AFIO_EXTICR_INDEX_EXTICR1 ((u8) 0)
#define AFIO_EXTICR_INDEX_EXTICR2 ((u8) 1)
#define AFIO_EXTICR_INDEX_EXTICR3 ((u8) 2)
#define AFIO_EXTICR_INDEX_EXTICR4 ((u8) 3)

/**
 * @{
 * Clearer naming for CAN Remap.
 */
#define AFIO_MAPR_CAN_REMAP_PA11_PA12 AFIO_MAPR_CAN_REMAP_REMAP1
#define AFIO_MAPR_CAN_REMAP_PB8_PB9   AFIO_MAPR_CAN_REMAP_REMAP2
#define AFIO_MAPR_CAN_REMAP_PD0_PD1   AFIO_MAPR_CAN_REMAP_REMAP3
/** @} */

#define CAN_ESR_LEC_NoError         ((u32) 0)
#define CAN_ESR_LEC_StuffErr        CAN_ESR_LEC_0
#define CAN_ESR_LEC_FormErr         CAN_ESR_LEC_1
#define CAN_ESR_LEC_AckErr          (CAN_ESR_LEC_1 | CAN_ESR_LEC_0)
#define CAN_ESR_LEC_BitRecessiveErr CAN_ESR_LEC_2
#define CAN_ESR_LEC_BitDominantErr  (CAN_ESR_LEC_2 | CAN_ESR_LEC_0)
#define CAN_ESR_LEC_CrcErr          (CAN_ESR_LEC_2 | CAN_ESR_LEC_1)

/* == types ====================================================== */
/* == global constants (extern) ================================== */
/* == global variables (extern) ================================== */
/* == access function prototypes ================================= */
/* == public function prototypes ================================= */
/* =============================================================== */
/* == End of $Workfile::   STM32Defs.h                        $ == */
/* =============================================================== */
/* --------------------------------------------------------------- */

#endif
